Catalogs/УчетныеЗаписиЦентровЭДО.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>УчетныеЗаписиЦентровЭДО</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>АдресСервиса</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ХешАдресаСервиса</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>32</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

InformationRegisters/НастройкиИнтеграцииЦентраЭДО.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>НастройкиИнтеграцииЦентраЭДО</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>УчетнаяЗаписьЦентраЭДО</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УчетныеЗаписиЦентровЭДО</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТребуетсяЗавершитьПереходВЦентрЭДО</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ИдентификаторЭДО</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>70</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Catalogs/УчетныеЗаписиЦентровЭДО/Ext/ObjectModule.bsl
// @strict-types


#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	ХешАдресаСервиса = ОбщегоНазначения.КонтрольнаяСуммаСтрокой(АдресСервиса);
	
	УчетнаяЗапись = Справочники.УчетныеЗаписиЦентровЭДО.НайтиПоАдресуСервиса(АдресСервиса);
	Если ЗначениеЗаполнено(УчетнаяЗапись)
		И УчетнаяЗапись <> Ссылка Тогда
		ТекстСообщения = СтрШаблон(НСтр("ru = 'Учетная запись центра ЭДО с адресом сервиса ""%1"" уже существует'"),
			АдресСервиса);
		ОбщегоНазначенияБЭД.ЗаписатьВЖурналРегистрации(ТекстСообщения,
			ОбщегоНазначенияБЭДКлиентСервер.ПодсистемыБЭД().ОбменСКонтрагентами);
		Отказ = Истина;
	КонецЕсли;
	
КонецПроцедуры

Процедура ПередУдалением(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	ИдентификаторыЭДО = РегистрыСведений.НастройкиИнтеграцииЦентраЭДО.ИдентификаторыЭДОУчетнойЗаписи(Ссылка);
	Если Не ЗначениеЗаполнено(ИдентификаторыЭДО) Тогда
		Возврат;
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Истина);
	Для Каждого ИдентификаторЭДО Из ИдентификаторыЭДО Цикл
		УчетныеЗаписиЭДО.УдалитьУчетнуюЗапись(ИдентификаторЭДО);
	КонецЦикла;
	УстановитьПривилегированныйРежим(Ложь);
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
